HANDLING MISSING DATA

*** None: missing data in Python ***

In [1]:
import numpy as np
import pandas as pd

In [2]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [3]:
for dtype in ['object', 'int']:
  print('dtype =', dtype)
  %timeit np.arange(1E6, dtype=dtype).sum()
  print()

dtype = object
66.3 ms ± 3.67 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
1.25 ms ± 13.9 μs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [4]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

NaN: missing number data

In [5]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [6]:
1 + np.nan

nan

In [7]:
0 * np.nan

nan

In [8]:
vals2.sum(), vals2.min(), vals2.max()

(np.float64(nan), np.float64(nan), np.float64(nan))

In [9]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(np.float64(8.0), np.float64(1.0), np.float64(4.0))

NaN and None values in the Pandas library

In [10]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [13]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [14]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

Operations on empty values

In [15]:
# isnull()
# notnull()
# dropna()
# fillna()

Detecting Null Values

In [16]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [17]:
data[data.notnull()]

0        1
2    hello
dtype: object

Removing empty values

In [19]:
data.dropna()

0        1
2    hello
dtype: object

In [20]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [21]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [22]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [23]:
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [25]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [26]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [28]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

Filling empty values

In [29]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('absde'))
data

a    1.0
b    NaN
s    2.0
d    NaN
e    3.0
dtype: float64

In [30]:
data.fillna(0)

a    1.0
b    0.0
s    2.0
d    0.0
e    3.0
dtype: float64

In [31]:
data.fillna(method='ffill')

/tmp/ipykernel_22863/1844443866.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill')

a    1.0
b    1.0
s    2.0
d    2.0
e    3.0
dtype: float64

In [33]:
data.ffill()

a    1.0
b    1.0
s    2.0
d    2.0
e    3.0
dtype: float64

In [34]:
data.fillna(method='bfill')

/tmp/ipykernel_22863/1397359497.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='bfill')

a    1.0
b    2.0
s    2.0
d    3.0
e    3.0
dtype: float64

In [35]:
data.bfill()

a    1.0
b    2.0
s    2.0
d    3.0
e    3.0
dtype: float64

In [36]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [37]:
df.fillna(method='ffill', axis=1)

/tmp/ipykernel_22863/901808322.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [38]:
df.ffill(axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [39]:
df.ffill(axis=0)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN